Wojtuz/Hamownia-2026/STM32/uart_can/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <libVescCan/VESC.h>
#include "vesc2halcan.h"
#include "libVescCan/VESC_Consts.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_R_Pin GPIO_PIN_13
#define LED_R_GPIO_Port GPIOC
#define LED_G_Pin GPIO_PIN_14
#define LED_G_GPIO_Port GPIOC
#define LED_B_Pin GPIO_PIN_15
#define LED_B_GPIO_Port GPIOC
#define nSLEEP_Pin GPIO_PIN_2
#define nSLEEP_GPIO_Port GPIOA
#define SNSOUT_Pin GPIO_PIN_3
#define SNSOUT_GPIO_Port GPIOA
#define nFAULT_Pin GPIO_PIN_4
#define nFAULT_GPIO_Port GPIOA
#define CAN_S_Pin GPIO_PIN_5
#define CAN_S_GPIO_Port GPIOA
#define CurentMeasurement_Pin GPIO_PIN_0
#define CurentMeasurement_GPIO_Port GPIOB
#define ENDSTOP_Pin GPIO_PIN_2
#define ENDSTOP_GPIO_Port GPIOB
#define ENDSTOP2_Pin GPIO_PIN_12
#define ENDSTOP2_GPIO_Port GPIOA
#define SW1_Pin GPIO_PIN_4
#define SW1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#include "can.h"
#include "uart.h"
#include "libVescCan/VESC_Convert.h"
#include "vesc2halcan.h"
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
